[
  {
    "title": "Managing Sustainable Growth at Netlight",
    "timeframe": "October 2014 - August 2024",
    "description": "Netlight is a company built and owned by its employees, fostering motivation for everyone to shape the company's future in alignment with their own needs, vision, and values. I was part of this journey for almost ten years, joining the German branch of Netlight when it had around 60 employees, to today, with over 700 active employees in Germany alone. During this time, I contributed significantly to the growth of Hamburg from 10 employees in 2016 to 170 employees in 2024. Major aspects of his work that was part of driving this growth can be summarized as follows: - Creating a culture of knowledge sharing by establishing various formats for consultants and other functions within Netlight to exchange thoughts and ideas, challenge each other, and learn through hands-on experience, listening, or observation. - Hiring and developing new talent within Netlight, both in consulting and sales and as a disciplinary leader of the company for over six years. This involved creating development plans and goals for employees, aligning them with their personal and Netlight's needs, and coaching colleagues to reach their full potential. - Allowing for more diverse talent to be seen in IT by establishing and supporting FINTA-related initiatives and projects together with non-profit and social organizations in Hamburg. - Aligning business needs with talent and engagement management, fostering an environment where people and business can grow together regardless of the company's stage. - Navigating challenging times with impacts on hiring, people development, and the type of employer Netlight needed to be. This included adjusting hiring strategies, finding ways to onboard and further develop talented colleagues, and identifying business opportunities in less-than-ideal market conditions."
  },
  {
    "title": "Architect",
    "timeframe": "February 2024 - August 2024",
    "description": "Being embedded in a team of three architects, I was responsible for aligning the Macro-Architecture with the teams and collect both business and technical needs for it. This helped to define guidelines for the teams to follow and implement their services against, creating a unified vision for all products. To effectively steer those efforts, we were creating formats to share, discuss and align team-needs and help them to take ownership of their own implementation-details."
  },
  {
    "title": "Product Architect",
    "timeframe": "January 2023 - January 2024",
    "description": "As a Product Architect, Stefan provided guidance for five application teams, aligning product architectures with the macro-architecture. He facilitated product-related and technical formats to understand needs and coordinate implementation efforts. Being part of the teams allowed him to maintain proximity and ensure alignment between micro and macro architectures. Stefans approach facilitated swift decision-making and effective development coordination, fostering a culture of knowledge sharing across teams."
  },
  {
    "title": "Team and Tech Lead",
    "timeframe": "July 2022 - December 2022",
    "description": "Leading a cloud migration project, Stefan orchestrated the technical roadmap and communication with stakeholders. He crafted a modern, event-driven architecture leveraging both on-premise and Google Cloud capabilities. Through Infrastructure-as-Code, he ensured repeatability and accountability in infrastructure changes. Stefans leadership fostered a culture of knowledge sharing, driving community practices and supporting team onboarding in new technologies."
  },
  {
    "title": "Site Reliability Engineer",
    "timeframe": "August 2021 - December 2021",
    "description": "Responsible for creating reusable components, Stefan automated infrastructure in Terraform, facilitating fast onboarding and deployment for teams. He started an internal open-source initiative, fostering knowledge and code sharing across teams. Stefan connected development teams to share best practices, driving knowledge sharing through various channels and supporting site reliability efforts."
  },
  {
    "title": "Solution Architect",
    "timeframe": "January 2021 - July 2021",
    "description": "Stefan played a crucial role in defining technical infrastructure and architectural guidelines, enabling scalable and maintainable application landscapes. His focus on implementation speed without sacrificing quality ensured rapid end user acceptance. Facilitating technical discussions and embracing a cloud-native approach, Stefan helped creating a low-maintenance infrastructure and drove development with a pragmatic approach."
  },
  {
    "title": "Solution Architect",
    "timeframe": "June 2020 - December 2020",
    "description": "Coordinating the architecture for an IoT platform across different subsidiaries, Stefan led discussions towards a unified system. His collaboration with product leads ensured alignment with market needs and integration of diverse solutions. Stefan's expertise facilitated the development of a flexible and scalable platform capable of meeting various market demands."
  },
  {
    "title": "Technical Lead",
    "timeframe": "June 2019 - April 2020",
    "description": "As the Solution Architect and Lead Developer, Stefan established infrastructural guidelines and best practices for development. His focus on creating fast and reliable workflows drove the project towards establishing an MVP quickly. Stefan's leadership in technical discussions and adoption of cloud-native principles enabled the team to create a scalable and maintainable infrastructure."
  },
  {
    "title": "Full Stack Developer",
    "timeframe": "January 2018 - May 2019",
    "description": "Stefan evaluated and implemented an external marketing software, focusing on scalability and response times. His involvement in cross-functional teams ensured alignment with various stakeholders and teams. By driving automation and infrastructure-as-code principles, Stefan facilitated continuous integration and deployment processes, enhancing the project's maintainability and stability."
  },
  {
    "title": "Technical Product Owner",
    "timeframe": "May 2017 - December 2017",
    "description": "Managing the infrastructure of a digital transformation project, Stefan bridged communication between IT providers and development teams. His role involved creating a vision for the future infrastructure, optimizing scalability and maintainability."
  },
  {
    "title": "Platform Engineer",
    "timeframe": "August 2016 - April 2017",
    "description": "Stefan contributed to the digital transformation of the companies core product, focusing on infrastructure maintenance and automation. His efforts ensured a high degree of automation in infrastructure changes and execution, enabling efficient development cycles and runtime monitoring."
  },
  {
    "title": "Full Stack Developer",
    "timeframe": "October 2014 - July 2016",
    "description": "Leading front-end engineering, Stefan drove feature development and maintenance, collaborating with cross-functional teams. He played a crucial role in advancing the architecture towards a scalable microservice infrastructure, emphasizing common workflows and technical improvements."
  }
]
